import { Text, VStack } from '@realsee/vapor';
import { FC } from 'react';

const About: FC = () => {
  return <VStack
    gap={`${40 / 16}rem`}
    flex={1}
    padding={{
      bottom: `${100 / 16}rem`
    }}
  >
    <VStack gap={`${12 / 16}rem`}>
      <Text size='md' weight='bold'>一、 免责声明</Text>
      <VStack gap={`${16 / 16}rem`}>
        <Text size='md' wrap opacity='50'>
          描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
        </Text>
        <Text size='md' wrap opacity='50'>
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案
        </Text>
      </VStack>
    </VStack>
    <VStack gap={`${12 / 16}rem`}>
      <Text size='md' weight='bold'>一、 免责声明</Text>
      <VStack gap={`${16 / 16}rem`}>
        <Text size='md' wrap opacity='50'>
          描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
        </Text>
        <Text size='md' wrap opacity='50'>
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文
          案描述文案支持最多600个字描述文案描述文案支
          持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述文案描述文案支持最多600个字描述
          文案描述文案支持最多600个字描述文案描述文案
        </Text>
      </VStack>
    </VStack>

  </VStack>;
};

export { About };
